README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Writing Exams/Quizzes with Org-Mode</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-03-18 Fri"/>
<meta name="author" content="G. Jay Kerns"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Writing Exams/Quizzes with Org-Mode</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What you need </a></li>
<li><a href="#sec-2">2 What you can do </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What you need </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>a version of <code>R</code>, plus the <code>R</code> package <code>distrEx</code> (and its dependencies) for this particular quiz.
</li>
<li>a suitably recent version of <a href="http://www.gnu.org/software/emacs/">GNU Emacs</a> (I'm running version 23.1.1).
</li>
<li>a suitably recent version of <a href="http://orgmode.org/">Org-Mode</a> (I'm running version 7.5.74).
</li>
<li>Org-mode configured suitably.  Have a look at <code>dotemacs.el</code> for the relevant parts of my <code>.emacs</code>. 
</li>
<li>the file <code>samplequiz.org</code> somewhere you can find it.
</li>
<li>the file <code>examformat.tex</code> in the same place as <code>samplequiz.org</code>.  Alternatively, you can insert each of the lines of <code>examformat.tex</code> at the top of the <code>.org</code> file, like this:
<pre class="example">
#+LATEX_HEADER: \usepackage[letterpaper]{geometry}
</pre>

<p>  and so forth.
</p></li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What you can do </h2>
<div class="outline-text-2" id="text-2">


<p>
If you would like to 
</p>
<ul>
<li>generate the exam (without answers), do
<pre class="example">
C-c C-e d
</pre>


</li>
<li>generate the exam (with answers), first delete the line
<pre class="example">
#+EXPORT_EXCLUDE_TAGS: answer
</pre>

<p>  then do
</p><pre class="example">
C-c C-e d
</pre>

<p>  <i>Note:</i> sometimes it takes a couple runs to get everything.
</p></li>
<li>tangle (most of) the R code, do
<pre class="example">
C-c C-v t
</pre>


</li>
<li>run the code interactively, put point somewhere in a code block (which starts with <code>#+begin_src R</code>) and do
<pre class="example">
C-c C-c
</pre>


</li>
<li>export the exam (with answers or not) to HTML (yes, that's right, HTML) then do
<pre class="example">
C-c C-e b
</pre>

<p>  <i>Note:</i> a few spots of this particular quiz don't show up very well in HTML. But, as you will see, a quiz that was even a little bit simpler than this one would show up just fine.  The tricky part is the substituted code that students type, currently typeset with a custom <code>studinpt</code> environment.
</p></li>
</ul>

</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-03-18 Fri</p>
<p class="author">Author: G. Jay Kerns</p>
<p class="email"><a href="mailto:gkerns@ysu.edu">gkerns@ysu.edu</a></p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
